{
  "backend/main.mo": "Minimal Motoko canister defining an empty actor.",
  "feature_evidence.json": "Report documenting implemented SEO-related features and associated files.",
  "frontend-file-summaries.txt": "Prewritten summaries of numerous frontend files for reference.",
  "frontend/index.css": "Empty stylesheet placeholder.",
  "frontend/index.html": "Main HTML entry point defining metadata, favicon, and root mount point.",
  "frontend/public/robots.txt": "Allows all crawling and points to sitemap.xml.",
  "frontend/public/sitemap.xml": "Sitemap listing all key site URLs with priorities and frequencies.",
  "frontend/src/App.tsx": "Main React app setup defining routing, layout, navigation, and tool pages.",
  "frontend/src/components/AdPlaceholder.tsx": "Stub component that renders nothing to avoid ads.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary displaying a user-friendly error UI.",
  "frontend/src/components/tools/LoadingIndicator.tsx": "Simple loading spinner with optional text.",
  "frontend/src/components/tools/RelatedTools.tsx": "Component showing related tool links excluding the current tool.",
  "frontend/src/components/tools/ToolShell.tsx": "Reusable layout wrapper for tool inputs, actions, results, and downloads.",
  "frontend/src/hooks/useActor.ts": "Provides a hook that creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider handling authentication, identity loading, and login state.",
  "frontend/src/index.css": "Defines global Tailwind styles and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders an About page describing the platform's mission and available tools.",
  "frontend/src/pages/AllToolsPage.tsx": "Displays a grid of all available tools with icons, descriptions, and links.",
  "frontend/src/pages/CalculatorsPage.tsx": "Lists all calculator tools in a grid with icons and navigation links.",
  "frontend/src/pages/ContactPage.tsx": "Shows contact information and email details for support and inquiries.",
  "frontend/src/pages/HomePage.tsx": "Provides the homepage with a hero section, tool categories, and feature highlights.",
  "frontend/src/pages/ImageToolsPage.tsx": "Lists available image-processing tools and displays them as clickable cards linking to their respective routes.",
  "frontend/src/pages/NotFoundPage.tsx": "Renders a 404 page with a message and buttons to return home or browse all tools.",
  "frontend/src/pages/PdfToolsPage.tsx": "Shows a grid of PDF-related tools with icons and links to their corresponding feature pages.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Displays the site's privacy policy, outlining data practices, file security, cookies, and update terms.",
  "frontend/src/pages/TermsPage.tsx": "Presents the site's terms of service including usage rules, disclaimers, liability limits, and modification terms.",
  "frontend/src/pages/tools/calculators/AgeCalculatorPage.tsx": "Provides an age calculator where users input a birth date to compute age in years, months, and days.",
  "frontend/src/pages/tools/calculators/BmiCalculatorPage.tsx": "Implements a BMI calculator that evaluates BMI, category, and color-coded health ranges based on height and weight.",
  "frontend/src/pages/tools/calculators/EmiCalculatorPage.tsx": "Calculates loan EMI, total payment, and interest from principal, rate, and tenure inputs, displaying detailed results.",
  "frontend/src/pages/tools/calculators/GstCalculatorPage.tsx": "Renders a GST calculator with inputs for amount, GST rate, and add/remove mode, displaying calculated GST and totals.",
  "frontend/src/pages/tools/calculators/LoanCalculatorPage.tsx": "Provides a loan calculator that computes monthly payments, total payment, and total interest from amount, rate, and tenure.",
  "frontend/src/pages/tools/calculators/PercentageCalculatorPage.tsx": "Implements percentage and percentage-change calculators using tabbed inputs and displays computed results or errors.",
  "frontend/src/pages/tools/calculators/SipCalculatorPage.tsx": "Calculates SIP maturity value, invested amount, and gains based on monthly investment, return rate, and duration.",
  "frontend/src/pages/tools/image/ImageCompressorPage.tsx": "Handles image compression with adjustable quality, showing original and compressed sizes, reduction percent, and download option.",
  "frontend/src/pages/tools/image/ImageConverterPage.tsx": "Allows uploading an image and converting it to JPEG, PNG, or WebP, with processing state and download of the converted file.",
  "frontend/src/pages/tools/image/ImageResizerPage.tsx": "React page providing an image resize tool with custom dimensions, aspect ratio option, preview of size changes, and download of the resized image.",
  "frontend/src/pages/tools/image/JpgToPngPage.tsx": "Simple JPG/JPEG-to-PNG converter page handling validation, conversion, error display, and PNG download.",
  "frontend/src/pages/tools/image/PngToJpgPage.tsx": "UI page for converting PNG images to JPG with upload, progress state, conversion handling, and JPG download.",
  "frontend/src/pages/tools/pdf/CompressPdfPage.tsx": "Page allowing users to upload and compress PDFs, showing a demo notice, progress state, summary, and download link.",
  "frontend/src/pages/tools/pdf/ImageToPdfPage.tsx": "Tool for uploading multiple images, converting them into a PDF (demo mode), showing selected files and enabling PDF download.",
  "frontend/src/pages/tools/pdf/JpgToPdfPage.tsx": "Converter page for turning one or more JPG images into a PDF using ToolShell, with demo notice, error handling, and download support.",
  "frontend/src/pages/tools/pdf/PdfMergePage.tsx": "UI page for selecting multiple PDFs, merging them via mergePdfs, and downloading the merged file.",
  "frontend/src/pages/tools/pdf/PdfSplitPage.tsx": "UI for selecting a PDF, specifying page ranges, splitting via splitPdf, and downloading the extracted pages.",
  "frontend/src/pages/tools/pdf/PdfToImagePage.tsx": "Page that uploads a PDF, converts pages to images using pdfToImage, and downloads the resulting ZIP.",
  "frontend/src/routes.ts": "Defines all application route constants for navigation across tools and pages.",
  "frontend/src/utils/calculators.ts": "Implements utility functions for age, GST, EMI/loan, and BMI calculations with validation.",
  "frontend/src/utils/download.ts": "Provides helpers to trigger Blob downloads and generate timestamped filenames.",
  "frontend/src/utils/format.ts": "Contains formatting utilities for bytes, numbers, and computing percentage reduction.",
  "frontend/src/utils/image.ts": "Implements image loading, compression, resizing, and format conversions using canvas APIs.",
  "frontend/src/utils/pdf.ts": "Provides demo placeholder implementations for creating, merging, splitting, compressing, and converting PDFs using simulated delays and text-based outputs.",
  "frontend/src/utils/seo.ts": "Defines SEO metadata for key routes and utilities to update document title and meta description dynamically.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, typography, animations, and container settings with several plugins.",
  "frontend/VERIFICATION_CHECKLIST.md": "Checklist for validating tool URLs, SEO metadata, and crawlability.",
  "project_state.json": "Tracks project metadata, existing features, and pending SEO update requirements for the Age Calculator page."
}