{
  "backend/main.mo": "Defines an empty Motoko actor with no methods.",
  "feature_evidence.json": "Feature evidence report describing a task to update email addresses in the frontend project.",
  "frontend-file-summaries.txt": "Lists short summaries of various frontend source files and their functionality.",
  "frontend/index.css": "Tailwind-based global stylesheet defining theme variables, dark mode colors, and base styles.",
  "frontend/index.html": "HTML entry point that sets metadata, favicon, root div, and loads the main React script.",
  "frontend/src/App.tsx": "Main SPA router component that renders pages based on path and handles navigation and history state.",
  "frontend/src/components/AdPlaceholder.tsx": "Stub component that intentionally renders nothing to avoid reintroducing ads.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that catches runtime errors and displays a user-friendly fallback UI.",
  "frontend/src/components/tools/LoadingIndicator.tsx": "Simple loading spinner component with optional status text.",
  "frontend/src/components/tools/ToolShell.tsx": "Layout wrapper for tool pages providing title, description, action buttons, loading state, and results UI.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor based on Internet Identity state using React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication hook and provider managing Internet Identity login, stored identities, and status.",
  "frontend/src/index.css": "Global Tailwind stylesheet defining OKLCH-based theme variables and base typography.",
  "frontend/src/main.tsx": "React entry point that sets up QueryClient, InternetIdentityProvider, and renders the app.",
  "frontend/src/pages/AboutPage.tsx": "Displays an About page describing SankalpHub’s mission, offerings, and privacy practices using styled cards.",
  "frontend/src/pages/AllToolsPage.tsx": "Renders a grid of all available tools with icons, descriptions, and navigation handlers.",
  "frontend/src/pages/CalculatorsPage.tsx": "Shows a categorized list of calculators with icons and routes for navigation.",
  "frontend/src/pages/ContactPage.tsx": "Provides contact information, including email and support details, inside styled card sections.",
  "frontend/src/pages/HomePage.tsx": "Implements the home screen with a hero banner, tool category navigation, and feature highlights.",
  "frontend/src/pages/ImageToolsPage.tsx": "Lists image-related tools like compression, resizing, and format conversion with navigation support.",
  "frontend/src/pages/PdfToolsPage.tsx": "Displays available PDF utilities such as merge, split, compress, and convert with clickable cards.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Shows the privacy policy with sections explaining data handling, security, cookies, and policy updates.",
  "frontend/src/pages/TermsPage.tsx": "Displays the Terms of Service with sections covering agreements, service use rules, warranties, liability limits, and updates.",
  "frontend/src/pages/tools/calculators/AgeCalculatorPage.tsx": "Provides an age calculator where users enter their birthdate and get age results in years, months, and days.",
  "frontend/src/pages/tools/calculators/BmiCalculatorPage.tsx": "Implements a BMI calculator that accepts height and weight to compute BMI and display its category.",
  "frontend/src/pages/tools/calculators/EmiCalculatorPage.tsx": "Calculates EMI, total payment, and total interest for a loan based on principal, rate, and tenure inputs.",
  "frontend/src/pages/tools/calculators/GstCalculatorPage.tsx": "Offers a GST calculator supporting add or remove mode to compute GST amount and final totals.",
  "frontend/src/pages/tools/calculators/LoanCalculatorPage.tsx": "Computes monthly payment, total payment, and interest for a loan using amount, interest rate, and tenure.",
  "frontend/src/pages/tools/calculators/PercentageCalculatorPage.tsx": "UI for calculating percentage values and percentage change using user inputs and utility functions.",
  "frontend/src/pages/tools/calculators/SipCalculatorPage.tsx": "SIP calculator page that computes maturity value, invested amount, and gains using user inputs and displays formatted results.",
  "frontend/src/pages/tools/image/ImageCompressorPage.tsx": "Image compression tool that lets users upload an image, adjust quality, compress it, and download the reduced file.",
  "frontend/src/pages/tools/image/ImageConverterPage.tsx": "Image format converter allowing uploads and conversion between JPEG, PNG, and WebP with download support.",
  "frontend/src/pages/tools/image/ImageResizerPage.tsx": "Image resizer that adjusts dimensions with optional aspect-ratio maintenance and provides a downloadable resized image.",
  "frontend/src/pages/tools/image/JpgToPngPage.tsx": "Simple JPG/JPEG to PNG converter that validates input, performs conversion, and enables downloading the PNG file.",
  "frontend/src/pages/tools/image/PngToJpgPage.tsx": "React page for uploading a PNG file, converting it to JPG, and downloading the result.",
  "frontend/src/pages/tools/pdf/CompressPdfPage.tsx": "UI for uploading a PDF, compressing it using a utility function, and downloading the compressed file with a summary.",
  "frontend/src/pages/tools/pdf/ImageToPdfPage.tsx": "Allows selecting multiple images, converting them into a single PDF, and downloading the generated file.",
  "frontend/src/pages/tools/pdf/JpgToPdfPage.tsx": "Uses ToolShell to convert JPG/JPEG images into a PDF, handle errors, and provide a downloadable output.",
  "frontend/src/pages/tools/pdf/PdfMergePage.tsx": "ToolShell-based interface for selecting and merging multiple PDFs into one, with result summary and download.",
  "frontend/src/pages/tools/pdf/PdfSplitPage.tsx": "ToolShell UI for selecting a PDF and extracting a page range into a new file, with validation and download.",
  "frontend/src/pages/tools/pdf/PdfToImagePage.tsx": "React page for uploading a PDF, converting it to images via pdfToImage, and downloading the result.",
  "frontend/src/routes.ts": "Defines constant route paths for all site pages and tools.",
  "frontend/src/utils/calculators.ts": "Provides calculation utilities for age, GST, EMI, loan, and BMI with validation and results.",
  "frontend/src/utils/download.ts": "Utility for triggering Blob downloads and generating timestamped filenames.",
  "frontend/src/utils/format.ts": "Formatting helpers for byte sizes, numbers, and percentage reduction.",
  "frontend/src/utils/image.ts": "Image utilities for loading, compressing, resizing, and converting between JPG and PNG formats.",
  "frontend/src/utils/pdf.ts": "Demo PDF utilities for creating, merging, splitting, compressing, and converting PDFs using placeholder output.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom colors, typography, layout, and animations.",
  "project_state.json": "Defines current project state, requirements, constraints, and known issues for updating and expanding SankalpHub. Specifies functional expectations for tools, branding rules, calculators to add, and conflicts to resolve."
}