{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report listing SEO and content-update features with affected files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend source files.",
  "frontend/index.css": "Empty stylesheet placeholder.",
  "frontend/index.html": "Main HTML entry file defining metadata, favicon, and root mounting point for the SPA.",
  "frontend/public/robots.txt": "Allows all crawlers and points to the sitemap URL.",
  "frontend/public/sitemap.xml": "Sitemap listing all primary site pages including tool URLs for SEO.",
  "frontend/src/App.tsx": "Root router setup with layout, navigation, and route definitions for all tool and informational pages.",
  "frontend/src/components/AdPlaceholder.tsx": "Placeholder component that renders nothing to avoid accidental ad insertion.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that catches runtime errors and displays a reload prompt.",
  "frontend/src/components/tools/LoadingIndicator.tsx": "Small component showing a spinning loader and optional text.",
  "frontend/src/components/tools/RelatedTools.tsx": "Component displaying cards linking to related tools based on the current tool.",
  "frontend/src/components/tools/ToolShell.tsx": "Reusable layout component that wraps tool UIs with headers, action buttons, loading state, results, and optional download button.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, logout, and stored identity restoration via AuthClient.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables defining light/dark theme colors and global typography.",
  "frontend/src/main.tsx": "App entry point initializing React, QueryClient, and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "Displays information about SankalpHub's mission, offerings, and privacy approach.",
  "frontend/src/pages/AllToolsPage.tsx": "Shows a grid of all available tools with icons, descriptions, and navigation links.",
  "frontend/src/pages/CalculatorsPage.tsx": "Lists available calculator tools with icons and links in a grid layout.",
  "frontend/src/pages/ContactPage.tsx": "Provides contact information including email and sections for business and support inquiries.",
  "frontend/src/pages/HomePage.tsx": "Landing page showing hero content and links to main tool categories with styled cards.",
  "frontend/src/pages/ImageToolsPage.tsx": "Displays a grid of image-related tools with icons and routes for compression, resizing, and conversion.",
  "frontend/src/pages/NotFoundPage.tsx": "Simple 404 page with message and buttons to navigate home or browse tools.",
  "frontend/src/pages/PdfToolsPage.tsx": "Lists available PDF tools such as merge, split, compress, and conversions using card-based navigation.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Static privacy policy outlining data handling, file security, cookies, and policy changes.",
  "frontend/src/pages/TermsPage.tsx": "Static terms of service detailing usage rules, disclaimers, liability limits, and term updates.",
  "frontend/src/pages/tools/calculators/AgeCalculatorPage.tsx": "Interactive age calculator that computes age from birth date and displays results with related tools.",
  "frontend/src/pages/tools/calculators/BmiCalculatorPage.tsx": "BMI calculator that computes BMI from height and weight and shows category results and ranges.",
  "frontend/src/pages/tools/calculators/EmiCalculatorPage.tsx": "Renders an EMI calculator page that takes loan inputs, calls calculateEmi, and displays EMI, total payment, and interest.",
  "frontend/src/pages/tools/calculators/GstCalculatorPage.tsx": "Provides a GST calculator allowing users to add or remove GST and shows GST amount and totals using calculateGst.",
  "frontend/src/pages/tools/calculators/LoanCalculatorPage.tsx": "Implements a loan calculator UI that computes monthly payment, total payment, and interest via calculateLoan.",
  "frontend/src/pages/tools/calculators/PercentageCalculatorPage.tsx": "Offers tools to compute percentages and percentage changes using calculatePercentage and calculatePercentageChange.",
  "frontend/src/pages/tools/calculators/SipCalculatorPage.tsx": "Builds a SIP calculator that calculates maturity value, invested amount, and gains based on monthly investments using calculateSip.",
  "frontend/src/pages/tools/image/ImageCompressorPage.tsx": "UI page for uploading an image, choosing compression quality, compressing it, and downloading the result.",
  "frontend/src/pages/tools/image/ImageConverterPage.tsx": "Provides an interface to convert images between JPEG, PNG, and WebP formats and download the converted file.",
  "frontend/src/pages/tools/image/ImageResizerPage.tsx": "Allows users to upload an image, input new dimensions, optionally maintain aspect ratio, resize it, and download the output.",
  "frontend/src/pages/tools/image/JpgToPngPage.tsx": "Dedicated tool page for converting JPG/JPEG images to PNG and downloading the converted file.",
  "frontend/src/pages/tools/image/PngToJpgPage.tsx": "UI for converting PNG files to JPG, showing progress and allowing download of the converted image.",
  "frontend/src/pages/tools/pdf/CompressPdfPage.tsx": "PDF compression tool page where users upload a PDF, trigger compression, view a summary, and download the compressed file.",
  "frontend/src/pages/tools/pdf/ImageToPdfPage.tsx": "React page that lets users upload images, convert them to a PDF using createPdfFromImages, and download the generated file.",
  "frontend/src/pages/tools/pdf/JpgToPdfPage.tsx": "ToolShell-based JPG-to-PDF converter allowing multiple JPG uploads, PDF generation, error handling, and download.",
  "frontend/src/pages/tools/pdf/PdfMergePage.tsx": "UI for merging multiple PDFs using mergePdfs with validation, loading states, and a downloadable merged file.",
  "frontend/src/pages/tools/pdf/PdfSplitPage.tsx": "PDF splitting tool where users select a file and page range, invoke splitPdf, and download the resulting segment.",
  "frontend/src/pages/tools/pdf/PdfToImagePage.tsx": "Page enabling PDF-to-image conversion via pdfToImage with upload, processing states, and image archive download.",
  "frontend/src/routes.ts": "Central route map defining paths for home, tools, calculators, and specific PDF/image utilities.",
  "frontend/src/utils/calculators.ts": "Provides functions for age, GST, EMI, loan, and BMI calculations with validation.",
  "frontend/src/utils/download.ts": "Handles browser blob downloads and generates timestamped filenames.",
  "frontend/src/utils/format.ts": "Offers helpers for formatting bytes, numbers, and computing percentage reduction.",
  "frontend/src/utils/image.ts": "Implements image loading, compression, resizing, and format conversion utilities.",
  "frontend/src/utils/pdf.ts": "Contains demo PDF utilities for creating, merging, splitting, compressing, and converting PDFs.",
  "frontend/src/utils/seo.ts": "Defines SEO titles and descriptions for various routes and tools.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, typography, animations, and plugins.",
  "frontend/VERIFICATION_CHECKLIST.md": "Checklist ensuring priority tool URLs load correctly, refresh properly, and include correct SEO metadata.",
  "project_state.json": "Defines the project’s SEO-only optimization scope, constraints, existing features, and pending request for updating metadata and intro copy on specified tool pages excluding EMI and Loan calculators."
}