{
  "backend/main.mo": "Defines an empty Motoko actor with no implemented logic.",
  "feature_evidence.json": "Contains feature evidence entries mapping SEO and content updates to specific frontend files and components.",
  "frontend-file-summaries.txt": "Lists short summaries of many frontend files describing their purpose and behavior.",
  "frontend/index.css": "Empty stylesheet placeholder with no content.",
  "frontend/index.html": "HTML entry point setting global metadata, favicon, and loading the React app.",
  "frontend/public/robots.txt": "Allows all user agents and points to the sitemap URL.",
  "frontend/public/sitemap.xml": "XML sitemap listing the homepage and all major tool and info page URLs.",
  "frontend/src/App.tsx": "Main React routing and layout file defining navigation, priority tools, SEO hooks, and page routes.",
  "frontend/src/components/AdPlaceholder.tsx": "Empty component that renders nothing to prevent ads from appearing.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary that catches runtime errors and displays a refresh prompt.",
  "frontend/src/components/tools/LoadingIndicator.tsx": "Simple loading spinner with optional text.",
  "frontend/src/components/tools/RelatedTools.tsx": "Displays related tool cards excluding the current tool with icons and links.",
  "frontend/src/components/tools/ToolShell.tsx": "Reusable layout wrapper for tool pages providing inputs, actions, loading states, results, and downloads.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the current Internet Identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/index.css": "Configures Tailwind base styles and defines CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Static page describing SankalpHub's mission and list of offered tools.",
  "frontend/src/pages/AllToolsPage.tsx": "Displays a grid of all available tools with icons, descriptions, and navigation links.",
  "frontend/src/pages/CalculatorsPage.tsx": "Shows a categorized list of calculator tools with icons and routes.",
  "frontend/src/pages/ContactPage.tsx": "Provides contact information and support details for SankalpHub users.",
  "frontend/src/pages/HomePage.tsx": "Homepage featuring a hero section, tool categories, and highlights of platform features.",
  "frontend/src/pages/ImageToolsPage.tsx": "Lists image-related tools and renders clickable cards linking to their routes.",
  "frontend/src/pages/NotFoundPage.tsx": "Displays a 404 page with navigation buttons to the homepage and all tools.",
  "frontend/src/pages/PdfToolsPage.tsx": "Shows a grid of PDF tools with icons and links to their respective routes.",
  "frontend/src/pages/PrivacyPolicyPage.tsx": "Renders the site's privacy policy with sections on data handling, security, cookies, and updates.",
  "frontend/src/pages/TermsPage.tsx": "Provides the site's terms of service, including usage rules, disclaimers, and liability limits.",
  "frontend/src/pages/tools/calculators/AgeCalculatorPage.tsx": "Implements an age calculator that computes years, months, and days from a birth date using ToolShell.",
  "frontend/src/pages/tools/calculators/BmiCalculatorPage.tsx": "Calculates BMI and displays the health category with color coding and reference ranges.",
  "frontend/src/pages/tools/calculators/EmiCalculatorPage.tsx": "Calculates EMI, total payment, and interest for loans and displays results in a structured layout.",
  "frontend/src/pages/tools/calculators/GstCalculatorPage.tsx": "Provides a GST calculator UI allowing users to add or remove GST and displays computed GST and totals.",
  "frontend/src/pages/tools/calculators/LoanCalculatorPage.tsx": "Implements a loan calculator that computes monthly payment, total payment, and interest based on inputs.",
  "frontend/src/pages/tools/calculators/PercentageCalculatorPage.tsx": "Offers tools to calculate percentage values and percentage change with tab-based UI and error handling.",
  "frontend/src/pages/tools/calculators/SipCalculatorPage.tsx": "Builds a SIP calculator that computes maturity value, invested amount, and gains using monthly investment inputs.",
  "frontend/src/pages/tools/image/ImageCompressorPage.tsx": "Provides an image compression tool that compresses images at adjustable quality and allows downloading results.",
  "frontend/src/pages/tools/image/ImageConverterPage.tsx": "Implements an image converter that transforms uploaded images into JPEG, PNG, or WebP formats and enables download.",
  "frontend/src/pages/tools/image/ImageResizerPage.tsx": "React page for resizing images with custom dimensions, aspect-ratio toggle, and download support.",
  "frontend/src/pages/tools/image/JpgToPngPage.tsx": "Provides JPG-to-PNG image conversion with file validation, processing state, and download output.",
  "frontend/src/pages/tools/image/PngToJpgPage.tsx": "UI for converting PNG images to JPG, showing upload, progress, success message, and download.",
  "frontend/src/pages/tools/pdf/CompressPdfPage.tsx": "PDF compression page that uploads a PDF, runs a compression utility, displays a summary, and enables download.",
  "frontend/src/pages/tools/pdf/ImageToPdfPage.tsx": "Converts multiple image files into a single PDF with processing indicators and download option.",
  "frontend/src/pages/tools/pdf/JpgToPdfPage.tsx": "ToolShell-based JPG-to-PDF converter handling multiple images, demo-mode warnings, and downloadable output.",
  "frontend/src/pages/tools/pdf/PdfMergePage.tsx": "UI page for merging multiple PDFs using mergePdfs and enabling download of the merged result.",
  "frontend/src/pages/tools/pdf/PdfSplitPage.tsx": "UI page for splitting a PDF by page range using splitPdf and downloading the extracted pages.",
  "frontend/src/pages/tools/pdf/PdfToImagePage.tsx": "UI page for converting a PDF into images via pdfToImage and downloading the generated ZIP.",
  "frontend/src/routes.ts": "Defines all frontend route constants for navigation including tool-specific paths.",
  "frontend/src/utils/calculators.ts": "Utility functions for age, GST, EMI, loan, and BMI calculations with validation.",
  "frontend/src/utils/download.ts": "Provides helpers to trigger Blob downloads and generate timestamped filenames.",
  "frontend/src/utils/format.ts": "Formatting utilities for bytes, numbers, and percentage reduction.",
  "frontend/src/utils/image.ts": "Image processing utilities for loading, compressing, resizing, and format conversion.",
  "frontend/src/utils/pdf.ts": "Provides demo placeholder implementations for creating, merging, splitting, compressing PDFs, and converting PDFs to images using simulated delays and text-based Blob outputs.",
  "frontend/src/utils/seo.ts": "Manages page SEO by setting document titles and meta descriptions, including predefined metadata for key tool routes.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, fonts, shadows, animations, and enabling plugins for typography, container queries, and animations.",
  "frontend/VERIFICATION_CHECKLIST.md": "Checklist verifying required tool URLs, SEO metadata, navigation, and crawlability.",
  "project_state.json": "Project metadata containing schema info, feature definitions, and pending requests related to updating EMI Calculator page SEO and content."
}