{
  "kind": "build_request",
  "title": "Replace all contact email addresses site-wide with SankalpHubsolutions@gmail.com",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-35",
      "text": "Search the entire frontend project for any existing email address text (including, but not limited to, the Contact page, Footer, and About page) and replace every occurrence with exactly: SankalpHubsolutions@gmail.com. Only update the email text itself; do not change any layout, styling, component structure, routes, tools, calculators, or page content beyond the email strings.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-latest"
        ],
        "quotes": [
          "Search the entire project and find any existing contact email text.\nThe email may appear in Contact page, Footer, or About section.\n\nReplace ALL existing email addresses with:\nSankalpHubsolutions@gmail.com\n\nDo NOT ask for file names.\nAutomatically locate the file and update only the email text.\nDo not change layout, tools, calculators, or design."
        ]
      },
      "acceptanceCriteria": [
        "All email addresses displayed anywhere in the UI are exactly \"SankalpHubsolutions@gmail.com\".",
        "No other email-like strings remain in the codebase UI content (e.g., previous addresses such as \"contact@sankalphub.com\" or \"business@sankalphub.com\" are fully removed/replaced).",
        "No non-email text, layout, styling, navigation, tools, or calculator functionality is changed as part of this update."
      ]
    }
  ],
  "constraints": [
    "Do not ask the user for file names; automatically locate and update occurrences in the codebase.",
    "Update only email-address text; do not modify layout, design, tools, calculators, routing, or any other content.",
    "Frontend immutablePaths must not be edited (compose existing UI components instead)."
  ],
  "nonGoals": [
    "Adding new contact methods (phone/WhatsApp/Telegram) or new sections/pages.",
    "Changing any navigation labels, routes, tool implementations, calculator logic, or styling.",
    "Backend changes or adding persistence/APIs."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}