{
  "kind": "build_request",
  "title": "Make Finance Guides page visible at /finance-guides and add it to main navigation",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure a publicly reachable Finance Guides page exists at the route /finance-guides (and is not a 404). If the page/route does not exist, create a new React page component and register it in the TanStack Router route tree so it renders within the existing Layout (header/footer/main container unchanged).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The Finance Guides page is not visible on the website.\n\nPlease:\n• Confirm if /finance-guides page was created\n• Add it to the main navigation menu\n• Make sure it is publicly accessible\n• Do NOT modify any existing tools\n\nDo not change anything else."
        ]
      },
      "acceptanceCriteria": [
        "Visiting /finance-guides in the browser renders the Finance Guides page content and does not show the NotFoundPage.",
        "The Finance Guides page renders inside the existing Layout component (same header/footer and container styling).",
        "No existing tool routes/components are modified."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a route constant for Finance Guides in frontend/src/routes.ts and use that constant consistently for routing and navigation linking.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Confirm if /finance-guides page was created",
          "Add it to the main navigation menu"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/routes.ts exports a new ROUTES entry for the Finance Guides path.",
        "The router registration and navigation link for Finance Guides reference the ROUTES constant (no duplicated hard-coded path strings for this page)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add “Finance Guides” to the main navigation menu in the existing navItems list (desktop and mobile). Append it without reordering or restyling existing items.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Add it to the main navigation menu",
          "Do NOT modify any existing tools",
          "Do not change anything else."
        ]
      },
      "acceptanceCriteria": [
        "Desktop header navigation shows a new link labeled “Finance Guides”.",
        "Mobile navigation shows the same “Finance Guides” link.",
        "The new link points to /finance-guides via the ROUTES constant.",
        "Existing navigation items remain in the same order and appearance; the Finance Guides item is appended."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure the Finance Guides page is publicly accessible (no authentication required, no conditional hiding). It must load correctly for anonymous users.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Make sure it is publicly accessible"
        ]
      },
      "acceptanceCriteria": [
        "When not logged in (anonymous), /finance-guides loads successfully and shows the Finance Guides page content.",
        "No login prompt or auth-gated logic blocks access to /finance-guides."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Apply non-homepage SEO behavior for the Finance Guides route consistent with other non-tool static pages (i.e., do not apply tool SEO; do not modify homepage SEO).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Do not change anything else."
        ]
      },
      "acceptanceCriteria": [
        "Navigating to /finance-guides applies the default (non-home) SEO behavior used by existing static pages (e.g., About/Contact) without altering the Home page SEO.",
        "No changes are made to existing tool SEO entries unless strictly required for Finance Guides."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Update the static sitemap (frontend/public/sitemap.xml) to include the /finance-guides URL while leaving all existing sitemap entries unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The Finance Guides page is not visible on the website."
        ]
      },
      "acceptanceCriteria": [
        "frontend/public/sitemap.xml contains a new <url> entry for https://sankalphub-a1l.caffeine.xyz/finance-guides.",
        "All existing <url> entries remain present and unchanged aside from insertion of the new entry."
      ]
    }
  ],
  "constraints": [
    "Do not modify any existing tools (UI, logic, routes, or tool utilities).",
    "Do not change the existing Layout structure or styling beyond appending a single new main navigation item.",
    "Do not change anything else outside what is required to create/confirm /finance-guides, add it to navigation, ensure public access, apply consistent SEO behavior, and update sitemap.",
    "Backend must remain single-actor; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Do not add or modify any calculator, PDF tool, or image tool functionality.",
    "Do not redesign the site theme, header, footer, or homepage.",
    "Do not add authentication or user accounts for Finance Guides.",
    "Do not add a CMS, admin editor, or dynamic content system for guides."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}