{
  "kind": "build_request",
  "title": "Update Age Calculator page SEO (title, meta description, H1, intro paragraph)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the Age Calculator route SEO metadata so that the browser page title and meta description match the provided SEO copy for the /age-calculator page.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Set the page title to:\nFree Age Calculator Online – Calculate Exact Age by Date of Birth",
          "Add this meta description:\nUse our free age calculator to calculate your exact age by date of birth. Get accurate age in years, months, and days instantly online."
        ]
      },
      "acceptanceCriteria": [
        "In frontend/src/utils/seo.ts, the TOOL_SEO entry for '/age-calculator' sets title to exactly: \"Free Age Calculator Online – Calculate Exact Age by Date of Birth\".",
        "In frontend/src/utils/seo.ts, the TOOL_SEO entry for '/age-calculator' sets description to exactly: \"Use our free age calculator to calculate your exact age by date of birth. Get accurate age in years, months, and days instantly online.\".",
        "Navigating to the Age Calculator page results in document.title and the meta[name=\"description\"] content reflecting the updated values."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the Age Calculator page on-screen SEO content so the H1 remains \"Free Age Calculator Online\" and the provided SEO introduction paragraph appears above the tool inputs/actions, without changing the tool behavior or layout structure.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Keep the H1 as:\nFree Age Calculator Online",
          "Add this SEO introduction paragraph at the top of the page above the tool:\n\nOur free age calculator helps you calculate your exact age by date of birth. This online age calculator provides accurate results in years, months, and days instantly.\n\nDo not change the design or tool functionality.\nOnly update SEO content."
        ]
      },
      "acceptanceCriteria": [
        "In frontend/src/pages/tools/calculators/AgeCalculatorPage.tsx, the ToolShell title is exactly: \"Free Age Calculator Online\" (this is the page H1).",
        "In frontend/src/pages/tools/calculators/AgeCalculatorPage.tsx, the text shown directly under the H1 and above the inputs matches exactly: \"Our free age calculator helps you calculate your exact age by date of birth. This online age calculator provides accurate results in years, months, and days instantly.\"",
        "No changes are made to the calculation logic, input fields, validation behavior, button behavior, or result rendering (only SEO copy is updated)."
      ]
    }
  ],
  "constraints": [
    "Do not change the Age Calculator design/layout beyond updating the specified SEO text.",
    "Do not change the Age Calculator tool functionality or calculation logic.",
    "Frontend immutable paths must not be edited (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui)."
  ],
  "nonGoals": [
    "Adding new pages, routes, or restructuring navigation.",
    "Implementing additional SEO features (e.g., Open Graph tags, JSON-LD, canonical URLs) beyond the requested title/meta description/on-page intro copy.",
    "Backend changes (Motoko) or persistence changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}