{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "EMI Calculator SEO metadata and intro content updates",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update /emi-calculator document title and meta description to the exact requested SEO strings without affecting other routes.",
      "acceptanceCriteria": [
        "When navigating to /emi-calculator, the browser tab title equals \"Free EMI Calculator Online – Home & Personal Loan EMI India\".",
        "When navigating to /emi-calculator, <meta name=\"description\"> content equals \"Calculate home loan, car loan and personal loan EMI instantly with our free EMI calculator online in India. Fast and accurate results.\".",
        "No other routes’ titles/descriptions change."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/seo.ts",
          "operation": "modify",
          "description": "Update the TOOL_SEO entry for '/emi-calculator' so applyToolSEO sets the document title and meta description to the exact required strings; do not change other route mappings."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Keep the EMI Calculator H1 exactly as requested and add the specified intro paragraph above the EMI tool UI without changing design or behavior.",
      "acceptanceCriteria": [
        "On /emi-calculator, the page’s primary heading (ToolShell title / H1 equivalent) renders exactly \"Free EMI Calculator Online\".",
        "The provided intro paragraph renders above the calculator inputs/actions within the EMI page content flow.",
        "Calculator inputs, calculation behavior, and result rendering remain unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/tools/calculators/EmiCalculatorPage.tsx",
          "operation": "modify",
          "description": "Update the ToolShell title to exactly \"Free EMI Calculator Online\" and ensure the intro paragraph text is rendered above the calculator UI (use the ToolShell description area so placement stays above the input/action section); do not alter calculation logic, inputs, or result rendering."
        }
      ]
    }
  ]
}