{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Expose Finance Guides at /finance-guides and add to main navigation",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Create/confirm a publicly reachable Finance Guides page at /finance-guides registered in the TanStack Router tree and rendered within the existing Layout.",
      "acceptanceCriteria": [
        "Visiting /finance-guides in the browser renders the Finance Guides page content and does not show the NotFoundPage.",
        "The Finance Guides page renders inside the existing Layout component (same header/footer and container styling).",
        "No existing tool routes/components are modified."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/FinanceGuidesPage.tsx",
          "operation": "create",
          "description": "Create a new Finance Guides React page component with static content consistent with existing non-tool pages (e.g., About/Contact). Use existing shadcn/ui Card components for layout consistency (verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register a new /finance-guides route in the TanStack Router route tree that renders the FinanceGuidesPage within the existing root Layout (header/footer/main container unchanged). Ensure this route does not collide with or alter any existing tool routes/components."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add a ROUTES constant for /finance-guides and use it consistently for router registration and navigation linking.",
      "acceptanceCriteria": [
        "frontend/src/routes.ts exports a new ROUTES entry for the Finance Guides path.",
        "The router registration and navigation link for Finance Guides reference the ROUTES constant (no duplicated hard-coded path strings for this page)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/routes.ts",
          "operation": "modify",
          "description": "Add ROUTES.FINANCE_GUIDES mapped to /finance-guides and export it alongside existing route constants."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update Finance Guides route registration and the navigation link to reference ROUTES.FINANCE_GUIDES (no hard-coded /finance-guides strings for this page)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Append a “Finance Guides” item to the existing main navigation navItems list for both desktop and mobile menus without reordering/restyling existing items.",
      "acceptanceCriteria": [
        "Desktop header navigation shows a new link labeled “Finance Guides”.",
        "Mobile navigation shows the same “Finance Guides” link.",
        "The new link points to /finance-guides via the ROUTES constant.",
        "Existing navigation items remain in the same order and appearance; the Finance Guides item is appended."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Append a new navItems entry { label: 'Finance Guides', path: ROUTES.FINANCE_GUIDES } at the end of the existing navItems array so it appears in both desktop and mobile navigation, without changing existing items' order or styling."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Ensure /finance-guides is publicly accessible (no authentication required and no conditional hiding) and loads for anonymous users.",
      "acceptanceCriteria": [
        "When not logged in (anonymous), /finance-guides loads successfully and shows the Finance Guides page content.",
        "No login prompt or auth-gated logic blocks access to /finance-guides."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the Finance Guides route is registered as a normal public route under the root Layout and is not wrapped in any auth-guard or conditional rendering logic; keep behavior consistent with other public static pages (About/Contact)."
        },
        {
          "path": "frontend/src/pages/FinanceGuidesPage.tsx",
          "operation": "create",
          "description": "Implement the Finance Guides page as static, anonymous-friendly content with no authentication-dependent hooks or conditional access logic (verify the component's usage instructions before implementing if using shadcn/ui building blocks)."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Apply default non-homepage, non-tool SEO behavior for /finance-guides consistent with existing static pages, without altering homepage SEO or tool SEO.",
      "acceptanceCriteria": [
        "Navigating to /finance-guides applies the default (non-home) SEO behavior used by existing static pages (e.g., About/Contact) without altering the Home page SEO.",
        "No changes are made to existing tool SEO entries unless strictly required for Finance Guides."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a FinanceGuides route wrapper component that calls restoreDefaultSEO() on mount (mirroring About/Contact) rather than applyToolSEO, and wire that wrapper to the Finance Guides route."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Update the static sitemap to include /finance-guides while leaving all existing entries unchanged.",
      "acceptanceCriteria": [
        "frontend/public/sitemap.xml contains a new <url> entry for https://sankalphub-a1l.caffeine.xyz/finance-guides.",
        "All existing <url> entries remain present and unchanged aside from insertion of the new entry."
      ],
      "file_operations": [
        {
          "path": "frontend/public/sitemap.xml",
          "operation": "modify",
          "description": "Insert a new <url> entry for https://sankalphub-a1l.caffeine.xyz/finance-guides, preserving all existing <url> entries exactly as-is aside from the new insertion."
        }
      ]
    }
  ]
}